Repository: HamxaBoustani/wandtech-console
Catalog: languages/wandtech-console-*.po
Languages: fa_ir

source: WandTech Console
fa_ir: کنسول وند تک

source: A high-performance, developer-centric framework for adding modular functionality to WordPress.
fa_ir: فریم‌ورکی قدرتمند، مخصوص توسعه‌دهندگان برای افزودن ویژگی‌های ماژولار به وردپرس.

source: WandTech
fa_ir: وند تک

source: Installing...
fa_ir: در حال نصب ...

source: Install Now
fa_ir: نصب کن

source: Creating...
fa_ir: در حال ایجاد...

source: Create Now
fa_ir: همین حالا بساز!

source: The elegant, high-performance way to add and manage powerful features.
fa_ir: راحت و بی‌دردسر ویژگی‌های حرفه‌ای رو بیار توی سایتت.

source: Made with %1$s by %2$s
fa_ir: ساختمش با %1$s - %2$s

source: Version %s
fa_ir: نسخه %s

source: Module status updated successfully.
fa_ir: وضعیت ماژول با موفقیت به‌روزرسانی شد.

source: Module deleted successfully.
fa_ir: ماژول با موفقیت حذف شد.

source: About
fa_ir: درباره

source: More Power, More Performance.
fa_ir: قدرتمندتر باش، سریع‌تر باش!

source: Thank you for choosing WandTech Console!
fa_ir: مرسی که وندتک کنسول رو انتخاب کردی، حالا همه‌چیز دست توئه!

source: About the Author
fa_ir: درباره نویسنده

source: This plugin was crafted with ❤️ by <strong>%s</strong>, a passionate developer dedicated to creating high-quality, performant, and user-friendly solutions for WordPress.
fa_ir: با ❤️ ساخته شده توسط <strong>%s</strong>، جوینده وردپرس، توسعه‌دهنده تازه کار و پرشور که دوست داره با راه‌حل‌های حرفه‌ای تجربه بهتری از کار با وردپرس رو برای کاربران فراهم کند.

source: Get Involved & Stay Connected
fa_ir: همراه شو و همیشه در جریان بمون!

source: Help us make this open-source project even better! Star us on GitHub, report issues, or connect on social media.
fa_ir: بیا پروژه رو بهتر کنیم! ⭐ راه های این تعامل؛ گیت‌هاب، گزارش باگ، و شبکه‌های اجتماعی!

source: GitHub Repository
fa_ir: ریپازیتوری گیتهاب

source: Follow on X
fa_ir: ایکس

source: Dashboard
fa_ir: داشبورد

source: Welcome to your Control Center
fa_ir: اینجا همون جاییه که همه‌چی دست توئه!

source: This is the central hub for all WandTech features. Manage powerful tools that enhance your site, all from one place.
fa_ir: این مرکز اصلی وندتک است، جایی که می‌توانید همه ابزارهای حرفه‌ای را مدیریت کنید.

source: System Status At a Glance
fa_ir: وضعیت سیستم در یک نگاه

source: Total Modules
fa_ir: مجموع ماژول‌ها

source: Active Modules
fa_ir: ماژول‌های فعال

source: Inactive Modules
fa_ir: ماژول‌های غیرفعال

source: Performance Optimizations
fa_ir: بهینه‌سازی پرفورمنس

source: To keep your site fast for visitors, we prevented %d admin-specific module from loading on the frontend.
fa_ir: برای بهینه‌سازی سرعت سایت برای کاربران، از بارگذاری %d ماژول مدیریتی در فرانت‌اند جلوگیری کردیم.

source: Server Environment
fa_ir: اطلاعات سرور

source: WordPress Constants
fa_ir: ثابت‌های وردپرس

source: File System Permissions
fa_ir: سطح دسترسی ها

source: Key File Status
fa_ir: وضعیت فایل‌های کلیدی

source: Enabled
fa_ir: فعال

source: Disabled
fa_ir: غیرفعال

source: Writable
fa_ir: قابل نوشتن

source: Not Writable
fa_ir: غیر قابل نوشتن

source: Present
fa_ir: هست

source: Missing
fa_ir: نیست

source: Install Module
fa_ir: نصب ماژول

source: Close
fa_ir: بستن

source: Install a New Module
fa_ir: نصب یه ماژول جدید

source: Upload a module in a .zip format to install it.
fa_ir: برای نصب، ماژول رو به فرمت .zip آپلود کن.

source: The module must be a correctly formatted .zip file.
fa_ir: فایل ماژول باید فرمت صحیح .zip را داشته باشد.

source: No file was uploaded or an error occurred during upload.
fa_ir: فایلی آپلود نشد یا خطایی در هنگام آپلود پیش آمد.

source: Invalid file type. Only .zip files are allowed.
fa_ir: نوع فایل نامعتبر است. فقط فایل‌های .zip مجاز هستند.

source: Modules
fa_ir: ماژول ها

source: All
fa_ir: همگی

source: Active
fa_ir: فعال

source: Inactive
fa_ir: غیر فعال

source: Search modules...
fa_ir: جستجوی ماژول ها...

source: No modules found matching your search criteria.
fa_ir: ماژولی که با جستجوی شما مطابقت داشته باشد، پیدا نشد.

source: Your Module Library is Empty
fa_ir: هیچ ماژولی بر روی کنسول وند تک شما وجود ندارد.

source: Start adding powerful features to your site right now.
fa_ir: الان وقتشه که ویژگی‌های حرفه‌ای رو به سایتت بیاری!

source: Version: %s
fa_ir: ورژن: %s

source: Author: %s
fa_ir: نویسنده: %s

source: Details
fa_ir: جزییات

source: Delete
fa_ir: حذف

source: Are you sure?
fa_ir: مطمئنی؟

source: This action cannot be undone.
fa_ir: این عملیات قابل بازگشت نیست.

source: Cancel
fa_ir: لغو

source: Yes, Delete Module
fa_ir: بله، ماژول را حذف کن

source: Create Module
fa_ir: ایجاد ماژول

source: Create a New Module
fa_ir: ساخت ماژول جدید

source: Fill out the details below. A new folder and boilerplate file will be created.
fa_ir: جزئیات پایین رو پر کن. یک پوشه جدید و فایل پایه ساخته خواهد شد.

source: Module Slug (Required)
fa_ir: Slug ماژول (ضروری)

source: Use lowercase letters, numbers, and hyphens only.
fa_ir: تنها استفاده از حروف کوچک، اعداد و خط تیره مجاز است.

source: Description (Required)
fa_ir: توضیحات (ضروری)

source: Scope (Required)
fa_ir: اسکوپ/محل بارگذاری (ضروری)

source: All: Loads everywhere (default)
fa_ir: همه: در همه‌جا بارگذاری می‌شود (پیش‌فرض)

source: Admin: Only loads in the WP dashboard
fa_ir: مدیریت: فقط در پیشخوان وردپرس بارگذاری می‌شود

source: Frontend: Only loads on the public-facing site
fa_ir: فرانت‌اند: فقط در سایت قابل مشاهده برای عموم بارگذاری می‌شود

source: Requires Plugins (Optional)
fa_ir: نیازمندی به افزونه‌ها (اختیاری)

source: Comma-separated list of required plugin files.
fa_ir: افزونه‌های مورد نیاز رو با کاما از هم جدا کنید.

source: Invalid slug format. Use lowercase letters, numbers, and hyphens only.
fa_ir: فرمت slug نامعتبر است. فقط از حروف کوچک، اعداد و خط تیره استفاده کنید.

source: Description is a required field.
fa_ir: فیلد توضیحات ضروری است.

source: Module created successfully!
fa_ir: ماژول با موفقیت ایجاد شد!

source: Settings
fa_ir: تنظیمات

source: Search settings...
fa_ir: جستجوی تنظیمات ...

source: No sections found.
fa_ir: چیزی پیدا نشد!

source: Save Changes
fa_ir: ذخیره تغییرات

source: General
fa_ir: تنظیمات عمومی

source: Developer Mode
fa_ir: حالت توسعه‌دهنده

source: Enables the loading of developer-specific system modules, such as the Module Scaffolder.
fa_ir: فعال‌سازی بارگذاری ماژول‌های سیستمی مخصوص توسعه‌دهنده، مانند Module Scaffolder.

source: Data Cleanup on Uninstall
fa_ir: پاک‌سازی داده‌ها هنگام حذف افزونه

source: If enabled, all WandTech Console data will be permanently deleted from your database when the plugin is uninstalled.
fa_ir: در صورت فعال بودن، تمام داده‌های وندتک کنسول هنگام حذف افزونه به‌طور دائمی از پایگاه داده شما پاک خواهند شد.

source: Default behavior is to keep data for safety.
fa_ir: حالت پیش‌فرض، نگه‌داشتن داده‌ها به‌منظور اطمینان است.
